// src/theme/colors.ts
export const colors = {
    primary: {
      50: '#E6F6FF',
      100: '#CCE9FF',
      200: '#99D0FF',
      300: '#66B7FF',
      400: '#339EFF',
      500: '#0085FF',  // Основной цвет
      600: '#006ACC',
      700: '#005099',
      800: '#003566',
      900: '#001B33',
    },
    secondary: {
      50: '#F5F0FF',
      100: '#EBE0FF',
      200: '#D6C2FF',
      300: '#C2A3FF',
      400: '#AD85FF',
      500: '#9966FF',  // Вторичный цвет
      600: '#7A52CC',
      700: '#5C3D99',
      800: '#3D2966',
      900: '#1F1433',
    },
    success: {
      500: '#38B2AC',
    },
    warning: {
      500: '#DD6B20',
    },
    error: {
      500: '#E53E3E',
    },
    gray: {
      50: '#F7FAFC',
      100: '#EDF2F7',
      200: '#E2E8F0',
      300: '#CBD5E0',
      400: '#A0AEC0',
      500: '#718096',
      600: '#4A5568',
      700: '#2D3748',
      800: '#1A202C',
      900: '#171923',
    },
  }